app/controllers/goals_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def show
    @user = User.find params[:id]

SELECT count(*) AS count_all FROM `goals` WHERE (`goals`.user_id = 3)
INSERT INTO `goals` (`number`, `message2`, `created_at`, `current`, `updated_at`, `user_id`, `message`) VALUES(1000, 'people', '2008-12-30 11:34:53', 0, '2008-12-30 11:34:53', 3, 'meet')
---
  def new
    return redirect_to(:action => :index) unless current_user.goals.size == 0
    return render unless request.post?
    params[:goals].each{|k, goal|
      current_user.goals << Goal.new(goal)