app/controllers/histories_controller.rb

  def add
    @goal = current_user.goals.find(params[:id])
    unless request.post?
      @history = @goal.histories.new :history_at => Time.now.strftime("%m/%d/%Y"), :style => 2
      return render :layout => false
    end
    @history = History.new params[:history]
    @history.before_number = @goal.current
    if params[:history][:style] == "1"
      @goal.current = params[:history][:number]
    else
      @goal.current += params[:history][:number].to_f
    end
    @history.after_number = @goal.current
    @goal.histories << @history
    @goal.save
---
SELECT * FROM `goals` WHERE (`goals`.`id` = 1 AND (`goals`.user_id = 3))
INSERT INTO `histories` (`number`, `before_number`, `history_at`, `created_at`, `after_number`, `updated_at`, `goal_id`, `message`, `style`) VALUES(9, 9.1, '2009-01-01', '2009-01-05 11:18:09', 18.1, '2009-01-05 11:18:09', 1, 'people met', 2)
UPDATE `goals` SET `updated_at` = '2009-01-05 11:00:06', `current` = 9.1 WHERE `id` = 1