app/controllers/profiles_controller.rb

UPDATE `profiles` SET `updated_at` = '2008-12-31 13:44:35', `twitter_username` = '' WHERE `id` = 3
UPDATE `users` SET `updated_at` = '2009-01-07 07:33:57', `name` = 'moongift', `email` = 'atsushi@moongift.jp' WHERE `id` = 1
---
  def update
    unless @profile.nil?
      @profile.update_attributes(params[:profile])
      @profile.user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def find_profile
    begin
      @user = User.find(params[:id])